artillery/results-summary/Resultado test spike algoritmo bybussiness.txt
All VUs finished. Total time: 1 minute, 51 seconds

--------------------------------
Summary report
--------------------------------

errors.ETIMEDOUT: .............................................................. 857
http.codes.200: ................................................................ 3894
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 46/sec
http.requests: ................................................................. 4750
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 9995
  mean: ........................................................................ 2985.3
  median: ...................................................................... 3828.5
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 7557.1
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 9995
  mean: ........................................................................ 2985.3
  median: ...................................................................... 3828.5
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 7557.1
http.responses: ................................................................ 3894
vusers.completed: .............................................................. 3893
vusers.created: ................................................................ 4750
vusers.created_by_name.Spike test: ............................................. 4750
vusers.failed: ................................................................. 857
vusers.session_length:
  min: ......................................................................... 3.8
  max: ......................................................................... 9952
  mean: ........................................................................ 3533.5
  median: ...................................................................... 3984.7
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 9607.1