artillery/results-summary/Resultado test spike algoritmo bytraffic.txt
All VUs finished. Total time: 1 minute, 51 seconds

--------------------------------
Summary report
--------------------------------

errors.ETIMEDOUT: .............................................................. 845
http.codes.200: ................................................................ 3905
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 4750
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 8728
  mean: ........................................................................ 2951.8
  median: ...................................................................... 3605.5
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 7557.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 8728
  mean: ........................................................................ 2951.8
  median: ...................................................................... 3605.5
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 7557.1
http.responses: ................................................................ 3905
vusers.completed: .............................................................. 3905
vusers.created: ................................................................ 4750
vusers.created_by_name.Spike test: ............................................. 4750
vusers.failed: ................................................................. 845
vusers.session_length:
  min: ......................................................................... 3.6
  max: ......................................................................... 10002.1
  mean: ........................................................................ 3455
  median: ...................................................................... 3905.8
  p95: ......................................................................... 8520.7
  p99: ......................................................................... 9801.2