artillery/results-summary/Resultado test spike no balancer.txt
All VUs finished. Total time: 1 minute, 51 seconds

--------------------------------
Summary report
--------------------------------

errors.ETIMEDOUT: .............................................................. 841
http.codes.200: ................................................................ 3908
http.codes.502: ................................................................ 1
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 24/sec
http.requests: ................................................................. 4750
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 8949
  mean: ........................................................................ 3054
  median: ...................................................................... 3905.8
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 7557.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 8949
  mean: ........................................................................ 3054.7
  median: ...................................................................... 3905.8
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 7557.1
http.response_time.5xx:
  min: ......................................................................... 443
  max: ......................................................................... 443
  mean: ........................................................................ 443
  median: ...................................................................... 441.5
  p95: ......................................................................... 441.5
  p99: ......................................................................... 441.5
http.responses: ................................................................ 3909
vusers.completed: .............................................................. 3909
vusers.created: ................................................................ 4750
vusers.created_by_name.Spike test: ............................................. 4750
vusers.failed: ................................................................. 841
vusers.session_length:
  min: ......................................................................... 3.6
  max: ......................................................................... 9986
  mean: ........................................................................ 3600.7
  median: ...................................................................... 4065.2
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 9801.2